In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [ ]:
df=pd.read_csv('/content/drive/My Drive/Colab Notebooks/DataSets/Churn.csv',engine='python')
df

      RowNumber  CustomerId    Surname  ...  IsActiveMember EstimatedSalary Exited
0             1    15634602   Hargrave  ...               1       101348.88      1
1             2    15647311       Hill  ...               1       112542.58      0
2             3    15619304       Onio  ...               0       113931.57      1
3             4    15701354       Boni  ...               0        93826.63      0
4             5    15737888   Mitchell  ...               1        79084.10      0
...         ...         ...        ...  ...             ...             ...    ...
9995       9996    15606229   Obijiaku  ...               0        96270.64      0
9996       9997    15569892  Johnstone  ...               1       101699.77      0
9997       9998    15584532        Liu  ...               1        42085.58      1
9998       9999    15682355  Sabbatini  ...               0        92888.52      1
9999      10000    15628319     Walker  ...               0        38190.78      0

[10000 rows x 14 columns]

# Questions on dataset

### Q1 Which Gender has highest Churn Ratio?

In [ ]:
gender_exit={'Male':0,'Female':0}
for i in range(0,10000):
    gender=df.loc[i,'Gender']
    if df.loc[i,'Exited']==1:
        count=int(gender_exit[gender])
        gender_exit[gender]=count+1
gender_exit

{'Female': 1139, 'Male': 898}

### Q2  Which Origins People Exited the organisation Most?

In [ ]:
Country_exit={'France':0,'Spain':0,'Germany':0}
for i in range(0,10000):
    origin=df.loc[i,'Geography']
    if df.loc[i,'Exited']==1:
        count=int(Country_exit[origin])
        Country_exit[origin]=count+1
Country_exit

{'France': 810, 'Germany': 814, 'Spain': 413}

### Q3 Gender Wise Churn from each Country?

In [ ]:
Spain_exit={'Male':0,'Female':0}
France_exit={'Male':0,'Female':0}
Germany_exit={'Male':0,'Female':0}
for i in range(0,10000):
    country=df.loc[i,'Geography']
    gender=df.loc[i,'Gender']
    if df.loc[i,'Exited']==1:
        if country=='Spain':
            count=int(Spain_exit[gender])
            Spain_exit[gender]=count+1
        elif country=='France':
            count=int(France_exit[gender])
            France_exit[gender]=count+1
        elif country=='Germany':
            count=int(Germany_exit[gender])
            Germany_exit[gender]=count+1
print("Spain",Spain_exit,"\nFrance",France_exit,"\nGermany",Germany_exit)

Spain {'Male': 182, 'Female': 231}
France {'Male': 350, 'Female': 460}
Germany {'Male': 366, 'Female': 448}

### Q4 If Persons with Highest and Lowest Salaries are still the part of Organisation or not?

In [ ]:
df2=df.sort_values(by='EstimatedSalary',ascending=False)

In [ ]:
df2.head(3)

      RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
6646       6647    15662021  Lucciano  ...               0       199992.48      0
3580       3581    15634359      Dyer  ...               0       199970.74      0
4417       4418    15697270    Gannon  ...               1       199953.33      0

[3 rows x 14 columns]

In [ ]:
df2.tail(3)

      RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
9010       9011    15786463     Hsing  ...               0           91.75      1
9647       9648    15679693    Walker  ...               1           90.07      0
2362       2363    15791053  Lucciano  ...               1           11.58      1

[3 rows x 14 columns]

### Q5 Average Credit Score of persons Exiting the Organisation

In [ ]:
credit_score=0
count=0
for i in range(0,10000):
    if df.loc[i,'Exited']==1:
        count=count+1
        credit_score=credit_score+df.loc[i,'CreditScore']
print("Average Credit Score:",credit_score/count)

Average Credit Score: 645.3514972999509

# Data Preprocessing

### Data Cleaning(Feature Selection)

In [ ]:
df.isnull().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [ ]:
df=df.drop(columns=['RowNumber','CustomerId','Surname'])

In [ ]:
col=list(df.columns)
len(col)

11

In [ ]:
for i in col:
    print(df[i].value_counts())

850    233
678     63
655     54
705     53
667     53
      ...
419      1
417      1
373      1
365      1
401      1
Name: CreditScore, Length: 460, dtype: int64
France     5014
Germany    2509
Spain      2477
Name: Geography, dtype: int64
Male      5457
Female    4543
Name: Gender, dtype: int64
37    478
38    477
35    474
36    456
34    447
     ...
92      2
88      1
82      1
85      1
83      1
Name: Age, Length: 70, dtype: int64
2     1048
1     1035
7     1028
8     1025
5     1012
3     1009
4      989
9      984
6      967
10     490
0      413
Name: Tenure, dtype: int64
0.00         3617
105473.74       2
130170.82       2
113063.83       1
80242.37        1
             ...
183555.24       1
137648.41       1
112689.95       1
115465.28       1
74681.90        1
Name: Balance, Length: 6382, dtype: int64
1    5084
2    4590
3     266
4      60
Name: NumOfProducts, dtype: int64
1    7055
0    2945
Name: HasCrCard, dtype: int64
1    5151
0    4849
Name: IsActiveMember, dtype: int64
24924.92     2
109029.72    1
182025.95    1
82820.85     1
30314.04     1
            ..
158302.59    1
171037.63    1
43036.60     1
55034.02     1
104181.78    1
Name: EstimatedSalary, Length: 9999, dtype: int64
0    7963
1    2037
Name: Exited, dtype: int64

In [ ]:
var_col=df.select_dtypes(include=['O']).columns
var_col

Index(['Geography', 'Gender'], dtype='object')

### Data Encoding

In [ ]:
df_dummy=pd.get_dummies(df)
df_dummy

      CreditScore  Age  Tenure  ...  Geography_Spain  Gender_Female  Gender_Male
0             619   42       2  ...                0              1            0
1             608   41       1  ...                1              1            0
2             502   42       8  ...                0              1            0
3             699   39       1  ...                0              1            0
4             850   43       2  ...                1              1            0
...           ...  ...     ...  ...              ...            ...          ...
9995          771   39       5  ...                0              0            1
9996          516   35      10  ...                0              0            1
9997          709   36       7  ...                0              1            0
9998          772   42       3  ...                0              0            1
9999          792   28       4  ...                0              1            0

[10000 rows x 14 columns]

In [ ]:
x=df_dummy.drop(columns=['Exited'])
y=df_dummy['Exited']
print(x.shape)
print(y.shape)

(10000, 13)
(10000,)

###  Train Test Spliting

In [ ]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.25,random_state=11)
print(x_train.shape)
print(x_test.shape)
print(y_train.shape)
print(y_test.shape)

(7500, 13)
(2500, 13)
(7500,)
(2500,)

### Standardization

In [ ]:
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
sc.fit(x_train)
x_train_sc=sc.transform(x_train)
x_test_sc=sc.transform(x_test)
print(x_train_sc)

[[-0.81163578  0.39555051 -1.05223259 ... -0.57509218 -0.91333963
   0.91333963]
 [-1.33538837 -0.46600675  0.68328475 ...  1.73885168  1.09488296
  -1.09488296]
 [-0.7808268  -0.84892108 -1.05223259 ...  1.73885168 -0.91333963
   0.91333963]
 ...
 [-0.26734386 -0.65746391  0.68328475 ...  1.73885168 -0.91333963
   0.91333963]
 [-1.4278153   0.29982192  1.37749168 ... -0.57509218 -0.91333963
   0.91333963]
 [-1.26350076 -1.61474975 -0.01092219 ... -0.57509218 -0.91333963
   0.91333963]]

# Model Training

## Logistic Regression

In [ ]:
from sklearn.linear_model import LogisticRegression
lin_clas_sc= LogisticRegression(random_state = 0)
lin_clas_sc.fit(x_train_sc, y_train)
print("Accuracy=",lin_clas_sc.score(x_test_sc,y_test))

Accuracy= 0.8112

## Support Vector Machine

In [ ]:
from sklearn.svm import SVC
svc_clas_sc=SVC(random_state=0)
svc_clas_sc.fit(x_train_sc,y_train)
print("Accuracy=",svc_clas_sc.score(x_test_sc,y_test))

Accuracy= 0.85

## K-nn Classification

In [ ]:
from sklearn.neighbors import KNeighborsClassifier
knn_avg=0
for i in range(5,25):
    knn_clas_sc=KNeighborsClassifier(n_neighbors=i)
    knn_clas_sc.fit(x_train_sc,y_train)
    print(i,"=",knn_clas_sc.score(x_test_sc,y_test))
    knn_avg=knn_clas_sc.score(x_test_sc,y_test)+knn_avg
print('Average=',knn_avg/20)

5 = 0.82
6 = 0.8212
7 = 0.8216
8 = 0.8276
9 = 0.8248
10 = 0.8272
11 = 0.8252
12 = 0.822
13 = 0.8252
14 = 0.828
15 = 0.8268
16 = 0.8256
17 = 0.8252
18 = 0.8252
19 = 0.8256
20 = 0.8248
21 = 0.8256
22 = 0.8236
23 = 0.8244
24 = 0.8236
Average= 0.8246600000000001

## Random Forest Classifcation

In [ ]:
from sklearn.ensemble import RandomForestClassifier
rfost_avg=0
for i in range(5,28):
    rfost_clas_sc=RandomForestClassifier(n_estimators=i,random_state=0);
    rfost_clas_sc.fit(x_train_sc,y_train)
    print(i,"=",rfost_clas_sc.score(x_test_sc,y_test))
    rfost_avg=rfost_clas_sc.score(x_test_sc,y_test)+rfost_avg
print('Average',rfost_avg/23)

5 = 0.832
6 = 0.8476
7 = 0.8392
8 = 0.8456
9 = 0.8484
10 = 0.8512
11 = 0.8508
12 = 0.8516
13 = 0.8488
14 = 0.8536
15 = 0.8548
16 = 0.8584
17 = 0.8568
18 = 0.8592
19 = 0.8584
20 = 0.8592
21 = 0.8588
22 = 0.8588
23 = 0.8596
24 = 0.8624
25 = 0.86
26 = 0.86
27 = 0.8584
Average 0.8536347826086955